# FilledRegionType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegionType Class
Members See Also
---
A filled region attributes element. Note, the forground pattern color is stored in the parent class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class FilledRegionType : LineAndTextAttrSymbol
```

Visual Basic
---
```text
Public Class FilledRegionType _
	Inherits LineAndTextAttrSymbol
```

Visual C++
---
```text
public ref class FilledRegionType : public LineAndTextAttrSymbol
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..LineAndTextAttrSymbol Autodesk.Revit.DB..::..FilledRegionType
# See Also
FilledRegionType Members
Autodesk.Revit.DB Namespace